# Maji Ndogo Part 2 - Clustering data to unveil Maji Ndogo's water crisis

#### This is the Part 2 of accessing the quality of water services for Maji Ndogo. 
- #### Part 1 of this project was done using MySQL workbench and project was shared as sql format.

- #### This part which is the second part of the project is also done using SQL but in jupiter notebooks.

In [191]:
# load and activate the SQL extension so we can execute SQL in jupiter notebook
%load_ext sql

The sql extension is already loaded. To reload it, use:
  %reload_ext sql

In [192]:
# Establish a connection to the local database with '%sql' magic command and the specific database we want to connect to
%sql mysql+pymysql://root:audreyTJ1*@localhost:3306/md_water_services

Connecting and switching to connection 'mysql+pymysql://root:***@localhost:3306/md_water_services'

In [193]:
%%sql

SELECT
    *
FROM 
    md_water_services.data_dictionary
LIMIT 3;

Running query in 'mysql+pymysql://root:***@localhost:3306/md_water_services'

3 rows affected.

+------------+----------------------+-------------------------------------+--------------+------------+
| table_name |     column_name      |             description             |   datatype   | related_to |
+------------+----------------------+-------------------------------------+--------------+------------+
|  employee  | assigned_employee_id | Unique ID assigned to each employee |     INT      |   visits   |
|  employee  |    employee_name     |         Name of the employee        | VARCHAR(255) |            |
|  employee  |     phone_number     |    Contact number of the employee   | VARCHAR(15)  |            |
+------------+----------------------+-------------------------------------+--------------+------------+

#### Exploring the first 5 rows of the visits table

In [194]:
%%sql

SELECT
    *
FROM
    visits
LIMIT 5;

Running query in 'mysql+pymysql://root:***@localhost:3306/md_water_services'

5 rows affected.

+-----------+-------------+--------------+---------------------+-------------+---------------+----------------------+
| record_id | location_id |  source_id   |    time_of_record   | visit_count | time_in_queue | assigned_employee_id |
+-----------+-------------+--------------+---------------------+-------------+---------------+----------------------+
|     0     |  SoIl32582  | SoIl32582224 | 2021-01-01 09:10:00 |      1      |       15      |          12          |
|     1     |  KiRu28935  | KiRu28935224 | 2021-01-01 09:17:00 |      1      |       0       |          46          |
|     2     |  HaRu19752  | HaRu19752224 | 2021-01-01 09:36:00 |      1      |       62      |          40          |
|     3     |  AkLu01628  | AkLu01628224 | 2021-01-01 09:53:00 |      1      |       0       |          1           |
|     4     |  AkRu03357  | AkRu03357224 | 2021-01-01 10:11:00 |      1      |       28      |          14          |
+-----------+-------------+--------------+---------------------+-------------+---------------+----------------------+

#### Previewing the employee table

In [195]:
%%sql
SELECT
    *
FROM
    employee
LIMIT 5;

Running query in 'mysql+pymysql://root:***@localhost:3306/md_water_services'

5 rows affected.

+----------------------+----------------+---------------+-------+-------------------------+---------------+-----------+----------------+
| assigned_employee_id | employee_name  |  phone_number | email |         address         | province_name | town_name |    position    |
+----------------------+----------------+---------------+-------+-------------------------+---------------+-----------+----------------+
|          0           |  Amara Jengo   | +99637993287  |  None | 36 Pwani Mchangani Road |     Sokoto    |   Ilanga  | Field Surveyor |
|          1           |  Bello Azibo   |  +99643864786 |  None |  129 Ziwa La Kioo Road  |    Kilimani   |   Rural   | Field Surveyor |
|          2           |  Bakari Iniko  | +99222599041  |  None |  18 Mlima Tazama Avenue |    Hawassa    |   Rural   | Field Surveyor |
|          3           | Malachi Mavuso | +99945849900  |  None |    100 Mogadishu Road   |     Akatsi    |   Lusaka  | Field Surveyor |
|          4           |  Cheche Buhle  | +99381679640  |  None |     1 Savanna Street    |     Akatsi    |   Rural   | Field Surveyor |
+----------------------+----------------+---------------+-------+-------------------------+---------------+-----------+----------------+

#### Making a copy of the employee table

In [197]:
%%sql
CREATE TABLE 
    employee_duplicate
AS
    (SELECT
        *
    FROM
        employee);

In [199]:
%%sql

SELECT
    *
FROM
    employee_duplicate
LIMIT 3;

Running query in 'mysql+pymysql://root:***@localhost:3306/md_water_services'

3 rows affected.

+----------------------+---------------+--------------+-----------------------------+-------------------------+---------------+-----------+----------------+
| assigned_employee_id | employee_name | phone_number |            email            |         address         | province_name | town_name |    position    |
+----------------------+---------------+--------------+-----------------------------+-------------------------+---------------+-----------+----------------+
|          0           |  Amara Jengo  | +99637993287 |  amara.jengo@ndogowater.gov | 36 Pwani Mchangani Road |     Sokoto    |   Ilanga  | Field Surveyor |
|          1           |  Bello Azibo  | +99643864786 |  bello.azibo@ndogowater.gov |  129 Ziwa La Kioo Road  |    Kilimani   |   Rural   | Field Surveyor |
|          2           |  Bakari Iniko | +99222599041 | bakari.iniko@ndogowater.gov |  18 Mlima Tazama Avenue |    Hawassa    |   Rural   | Field Surveyor |
+----------------------+---------------+--------------+-----------------------------+-------------------------+---------------+-----------+----------------+

#### Updating the database with email addresses

In [201]:
%%sql

SELECT
    LOWER(REPLACE(employee_name, " ", "."))
FROM
    employee_duplicate
LIMIT 3;

Running query in 'mysql+pymysql://root:***@localhost:3306/md_water_services'

3 rows affected.

+-----------------------------------------+
| LOWER(REPLACE(employee_name, " ", ".")) |
+-----------------------------------------+
|               amara.jengo               |
|               bello.azibo               |
|               bakari.iniko              |
+-----------------------------------------+

In [202]:
%%sql

SELECT
    CONCAT(LOWER(REPLACE(employee_name, " ", ".")),'@ndogowater.gov')
FROM
    employee_duplicate
LIMIT 3;

Running query in 'mysql+pymysql://root:***@localhost:3306/md_water_services'

3 rows affected.

+-------------------------------------------------------------------+
| CONCAT(LOWER(REPLACE(employee_name, " ", ".")),'@ndogowater.gov') |
+-------------------------------------------------------------------+
|                     amara.jengo@ndogowater.gov                    |
|                     bello.azibo@ndogowater.gov                    |
|                    bakari.iniko@ndogowater.gov                    |
+-------------------------------------------------------------------+

#### Adding/ inserting the emails into the table

In [12]:
%%sql

UPDATE employee_duplicate
SET email = CONCAT(LOWER(REPLACE(employee_name, " ", ".")),'@ndogowater.gov')

Running query in 'mysql+pymysql://root:***@localhost:3306/md_water_services'

56 rows affected.

++
||
++
++

In [203]:
%%sql

SELECT
    *
FROM
    employee_duplicate
LIMIT 3;

Running query in 'mysql+pymysql://root:***@localhost:3306/md_water_services'

3 rows affected.

+----------------------+---------------+--------------+-----------------------------+-------------------------+---------------+-----------+----------------+
| assigned_employee_id | employee_name | phone_number |            email            |         address         | province_name | town_name |    position    |
+----------------------+---------------+--------------+-----------------------------+-------------------------+---------------+-----------+----------------+
|          0           |  Amara Jengo  | +99637993287 |  amara.jengo@ndogowater.gov | 36 Pwani Mchangani Road |     Sokoto    |   Ilanga  | Field Surveyor |
|          1           |  Bello Azibo  | +99643864786 |  bello.azibo@ndogowater.gov |  129 Ziwa La Kioo Road  |    Kilimani   |   Rural   | Field Surveyor |
|          2           |  Bakari Iniko | +99222599041 | bakari.iniko@ndogowater.gov |  18 Mlima Tazama Avenue |    Hawassa    |   Rural   | Field Surveyor |
+----------------------+---------------+--------------+-----------------------------+-------------------------+---------------+-----------+----------------+

#### Previewing length of phone number

In [204]:
%%sql

SELECT
    LENGTH(phone_number)
FROM
    employee_duplicate
LIMIT 3;

Running query in 'mysql+pymysql://root:***@localhost:3306/md_water_services'

3 rows affected.

+----------------------+
| LENGTH(phone_number) |
+----------------------+
|          12          |
|          12          |
|          12          |
+----------------------+

#### Trimming phone number column to remove extra space

In [205]:
%%sql

SELECT
    LENGTH(TRIM(phone_number))
FROM
    employee_duplicate
LIMIT 3;

Running query in 'mysql+pymysql://root:***@localhost:3306/md_water_services'

3 rows affected.

+----------------------------+
| LENGTH(TRIM(phone_number)) |
+----------------------------+
|             12             |
|             12             |
|             12             |
+----------------------------+

In [16]:
#update length of phone number
%sql UPDATE employee_duplicate SET phone_number =  TRIM(phone_number)

Running query in 'mysql+pymysql://root:***@localhost:3306/md_water_services'

56 rows affected.

++
||
++
++

In [206]:
%%sql 

SELECT 
    phone_number 
FROM 
    employee_duplicate
LIMIT 3;

Running query in 'mysql+pymysql://root:***@localhost:3306/md_water_services'

3 rows affected.

+--------------+
| phone_number |
+--------------+
| +99637993287 |
| +99643864786 |
| +99222599041 |
+--------------+

#### Previewing length of phone number to see if change was effected

In [207]:
%%sql 

SELECT 
    LENGTH(phone_number) 
FROM 
    employee_duplicate
LIMIT 3;

Running query in 'mysql+pymysql://root:***@localhost:3306/md_water_services'

3 rows affected.

+----------------------+
| LENGTH(phone_number) |
+----------------------+
|          12          |
|          12          |
|          12          |
+----------------------+

Honouring the workers
- Let's see where they live
- How many of our employees live in each town.

#### Where they live

In [208]:
%%sql

SELECT
    employee_name,province_name,town_name
FROM
    employee_duplicate
LIMIT 3;

Running query in 'mysql+pymysql://root:***@localhost:3306/md_water_services'

3 rows affected.

+---------------+---------------+-----------+
| employee_name | province_name | town_name |
+---------------+---------------+-----------+
|  Amara Jengo  |     Sokoto    |   Ilanga  |
|  Bello Azibo  |    Kilimani   |   Rural   |
|  Bakari Iniko |    Hawassa    |   Rural   |
+---------------+---------------+-----------+

#### Number of employees living in each town.

In [209]:
%%sql

SELECT
    town_name,COUNT(town_name) AS number_of_employees
FROM
    employee_duplicate
GROUP BY town_name
LIMIT 3;

Running query in 'mysql+pymysql://root:***@localhost:3306/md_water_services'

3 rows affected.

+-----------+---------------------+
| town_name | number_of_employees |
+-----------+---------------------+
|   Ilanga  |          3          |
|   Rural   |          29         |
|   Lusaka  |          4          |
+-----------+---------------------+

#### Making a copy of the visits table

In [26]:
%%sql
CREATE TABLE 
    visits_duplicate
AS
    (SELECT
        *
    FROM
        visits);

Running query in 'mysql+pymysql://root:***@localhost:3306/md_water_services'

60146 rows affected.

++
||
++
++

In [210]:
%%sql

SELECT
    *
FROM
    visits_duplicate
LIMIT 3;

Running query in 'mysql+pymysql://root:***@localhost:3306/md_water_services'

3 rows affected.

+-----------+-------------+--------------+---------------------+-------------+---------------+----------------------+
| record_id | location_id |  source_id   |    time_of_record   | visit_count | time_in_queue | assigned_employee_id |
+-----------+-------------+--------------+---------------------+-------------+---------------+----------------------+
|     0     |  SoIl32582  | SoIl32582224 | 2021-01-01 09:10:00 |      1      |       15      |          12          |
|     1     |  KiRu28935  | KiRu28935224 | 2021-01-01 09:17:00 |      1      |       0       |          46          |
|     2     |  HaRu19752  | HaRu19752224 | 2021-01-01 09:36:00 |      1      |       62      |          40          |
+-----------+-------------+--------------+---------------------+-------------+---------------+----------------------+

In [35]:
%%sql 
SELECT 
    e.employee_name,e.email,e.phone_number,
    COUNT(v.visit_count) AS number_of_visits
FROM 
    employee_duplicate e
JOIN
    visits_duplicate v
ON
    e.assigned_employee_id = v.assigned_employee_id
GROUP BY employee_name,email,phone_number
ORDER BY number_of_visits DESC
LIMIT 3;

Running query in 'mysql+pymysql://root:***@localhost:3306/md_water_services'

3 rows affected.

+---------------+----------------------------+--------------+------------------+
| employee_name |           email            | phone_number | number_of_visits |
+---------------+----------------------------+--------------+------------------+
|  Bello Azibo  | bello.azibo@ndogowater.gov | +99643864786 |       3708       |
|   Pili Zola   |  pili.zola@ndogowater.gov  | +99822478933 |       3676       |
|   Rudo Imani  | rudo.imani@ndogowater.gov  | +99046972648 |       3539       |
+---------------+----------------------------+--------------+------------------+

In [49]:
%%sql 
SELECT 
    e.assigned_employee_id,
    COUNT(v.visit_count) AS number_of_visits
FROM 
    employee_duplicate e
JOIN
    visits_duplicate v
ON
    e.assigned_employee_id = v.assigned_employee_id
GROUP BY e.assigned_employee_id
ORDER BY number_of_visits DESC
LIMIT 3;

Running query in 'mysql+pymysql://root:***@localhost:3306/md_water_services'

3 rows affected.

+----------------------+------------------+
| assigned_employee_id | number_of_visits |
+----------------------+------------------+
|          1           |       3708       |
|          30          |       3676       |
|          34          |       3539       |
+----------------------+------------------+

In [51]:
%%sql 
SELECT 
    employee_name,email,phone_number
FROM 
    employee_duplicate
WHERE assigned_employee_id IN (1,30,34);

Running query in 'mysql+pymysql://root:***@localhost:3306/md_water_services'

3 rows affected.

+---------------+----------------------------+--------------+
| employee_name |           email            | phone_number |
+---------------+----------------------------+--------------+
|  Bello Azibo  | bello.azibo@ndogowater.gov | +99643864786 |
|   Pili Zola   |  pili.zola@ndogowater.gov  | +99822478933 |
|   Rudo Imani  | rudo.imani@ndogowater.gov  | +99046972648 |
+---------------+----------------------------+--------------+

#### Creating a duplicate of locations table

In [52]:
%%sql
CREATE TABLE 
    location_duplicate
AS
    (SELECT
        *
    FROM
        location);

Running query in 'mysql+pymysql://root:***@localhost:3306/md_water_services'

39650 rows affected.

++
||
++
++

In [211]:
%%sql
SELECT
    province_name,town_name,location_type
FROM
    location_duplicate
LIMIT 3;

Running query in 'mysql+pymysql://root:***@localhost:3306/md_water_services'

3 rows affected.

+---------------+-----------+---------------+
| province_name | town_name | location_type |
+---------------+-----------+---------------+
|     Akatsi    |   Harare  |     Urban     |
|     Akatsi    |   Harare  |     Urban     |
|     Akatsi    |   Harare  |     Urban     |
+---------------+-----------+---------------+

In [212]:
#counts the number of records per town
%sql SELECT COUNT(*) AS records_per_town,town_name FROM location_duplicate GROUP BY town_name ORDER BY records_per_town DESC LIMIT 3;

Running query in 'mysql+pymysql://root:***@localhost:3306/md_water_services'

3 rows affected.

+------------------+-----------+
| records_per_town | town_name |
+------------------+-----------+
|      23740       |   Rural   |
|       1650       |   Harare  |
|       1090       |   Amina   |
+------------------+-----------+

In [213]:
#counting records per town
%sql SELECT COUNT(*) AS records_per_province,province_name FROM location_duplicate GROUP BY province_name ORDER BY records_per_province DESC LIMIT 3;

Running query in 'mysql+pymysql://root:***@localhost:3306/md_water_services'

3 rows affected.

+----------------------+---------------+
| records_per_province | province_name |
+----------------------+---------------+
|         9510         |    Kilimani   |
|         8940         |     Akatsi    |
|         8220         |     Sokoto    |
+----------------------+---------------+

In [214]:
%%sql

SELECT 
    province_name,town_name,COUNT(town_name) AS records_per_town 
FROM 
    location_duplicate 
GROUP BY 
    province_name,town_name 
ORDER BY 
    province_name,records_per_town DESC
LIMIT 3;

Running query in 'mysql+pymysql://root:***@localhost:3306/md_water_services'

3 rows affected.

+---------------+-----------+------------------+
| province_name | town_name | records_per_town |
+---------------+-----------+------------------+
|     Akatsi    |   Rural   |       6290       |
|     Akatsi    |   Lusaka  |       1070       |
|     Akatsi    |   Harare  |       800        |
+---------------+-----------+------------------+

#### Number of records for each location type

In [215]:
%%sql

SELECT
    COUNT(*) AS number_of_source,location_type
FROM
    location_duplicate
GROUP BY 
    location_type
LIMIT 3;

Running query in 'mysql+pymysql://root:***@localhost:3306/md_water_services'

2 rows affected.

+------------------+---------------+
| number_of_source | location_type |
+------------------+---------------+
|      15910       |     Urban     |
|      23740       |     Rural     |
+------------------+---------------+

#### Percentages

#### Total number of sources for rural

In [217]:
%%sql 

SELECT
    ROUND(COUNT(*)/39650 *100,0) AS rural_percentage
FROM
    location_duplicate
WHERE
    location_type = 'Rural';

Running query in 'mysql+pymysql://root:***@localhost:3306/md_water_services'

1 rows affected.

+------------------+
| rural_percentage |
+------------------+
|        60        |
+------------------+

In [72]:
%%sql 

SELECT
    ROUND(COUNT(*)/39650 *100,0) AS urban_percentage
FROM
    location_duplicate
WHERE
    location_type = 'Urban';

Running query in 'mysql+pymysql://root:***@localhost:3306/md_water_services'

1 rows affected.

+------------------+
| urban_percentage |
+------------------+
|        40        |
+------------------+

#### Copy of water source table

In [73]:
%%sql
CREATE TABLE 
    water_source_duplicate
AS
    (SELECT
        *
    FROM
        water_source);

Running query in 'mysql+pymysql://root:***@localhost:3306/md_water_services'

39650 rows affected.

++
||
++
++

In [218]:
%%sql

SELECT
    *
FROM
    water_source_duplicate
LIMIT 3;

Running query in 'mysql+pymysql://root:***@localhost:3306/md_water_services'

3 rows affected.

+--------------+----------------------+-------------------------+
|  source_id   | type_of_water_source | number_of_people_served |
+--------------+----------------------+-------------------------+
| AkHa00000224 |     tap_in_home      |           956           |
| AkHa00001224 |  tap_in_home_broken  |           930           |
| AkHa00002224 |  tap_in_home_broken  |           486           |
+--------------+----------------------+-------------------------+

In [81]:
#unique water sources and the number of people served
%sql SELECT DISTINCT(type_of_water_source) FROM water_source_duplicate;

Running query in 'mysql+pymysql://root:***@localhost:3306/md_water_services'

5 rows affected.

+----------------------+
| type_of_water_source |
+----------------------+
|     tap_in_home      |
|  tap_in_home_broken  |
|         well         |
|      shared_tap      |
|        river         |
+----------------------+

unique water sources and the number of people served

#### Unique water sources and the number of people served

#### Number of people surved

In [86]:
%%sql

SELECT COUNT(*) FROM water_source;

Running query in 'mysql+pymysql://root:***@localhost:3306/md_water_services'

1 rows affected.

+----------+
| COUNT(*) |
+----------+
|  39650   |
+----------+

#### Number of wells, taps and rivers there are

In [219]:
%%sql

SELECT 
    type_of_water_source,COUNT(type_of_water_source) 
FROM 
    water_source_duplicate
GROUP BY
    type_of_water_source
LIMIT 3;

Running query in 'mysql+pymysql://root:***@localhost:3306/md_water_services'

3 rows affected.

+----------------------+-----------------------------+
| type_of_water_source | COUNT(type_of_water_source) |
+----------------------+-----------------------------+
|     tap_in_home      |             7265            |
|  tap_in_home_broken  |             5856            |
|         well         |            17383            |
+----------------------+-----------------------------+

 #### Number of people who share particular types of water sources on average

In [220]:
%%sql

SELECT 
    type_of_water_source,
    ROUND(AVG(number_of_people_served),0) AS avg_pple
FROM 
    water_source_duplicate
GROUP BY
    type_of_water_source
LIMIT 3;

Running query in 'mysql+pymysql://root:***@localhost:3306/md_water_services'

3 rows affected.

+----------------------+----------+
| type_of_water_source | avg_pple |
+----------------------+----------+
|     tap_in_home      |   644    |
|  tap_in_home_broken  |   649    |
|         well         |   279    |
+----------------------+----------+

#### Number of people getting water from each type of source

In [221]:
%%sql

SELECT
    type_of_water_source, 
    SUM(number_of_people_served) AS no_ppl_access
FROM
    water_source_duplicate
GROUP BY
     type_of_water_source
LIMIT 3;

Running query in 'mysql+pymysql://root:***@localhost:3306/md_water_services'

3 rows affected.

+----------------------+---------------+
| type_of_water_source | no_ppl_access |
+----------------------+---------------+
|     tap_in_home      |    4678880    |
|  tap_in_home_broken  |    3799720    |
|         well         |    4841724    |
+----------------------+---------------+

#### Actual average since on average 6 people share a tap in a household

In [222]:
%%sql

SELECT 
    type_of_water_source,
    ROUND(AVG(number_of_people_served)/6,0) AS avg_pple
FROM 
    water_source_duplicate
GROUP BY
    type_of_water_source
LIMIT 3;

Running query in 'mysql+pymysql://root:***@localhost:3306/md_water_services'

3 rows affected.

+----------------------+----------+
| type_of_water_source | avg_pple |
+----------------------+----------+
|     tap_in_home      |   107    |
|  tap_in_home_broken  |   108    |
|         well         |    46    |
+----------------------+----------+

#### Ordering by most people served

In [223]:
%%sql

SELECT
    type_of_water_source, 
    SUM(number_of_people_served) AS people_served
FROM
    water_source_duplicate
GROUP BY
     type_of_water_source
ORDER BY 
    people_served DESC
LIMIT 3;

Running query in 'mysql+pymysql://root:***@localhost:3306/md_water_services'

3 rows affected.

+----------------------+---------------+
| type_of_water_source | people_served |
+----------------------+---------------+
|      shared_tap      |    11945272   |
|         well         |    4841724    |
|     tap_in_home      |    4678880    |
+----------------------+---------------+

#### Previewing the total numbr of peple served

In [106]:
%%sql 

SELECT
     SUM(number_of_people_served) AS total_people_served
FROM
    water_source_duplicate;

Running query in 'mysql+pymysql://root:***@localhost:3306/md_water_services'

1 rows affected.

+---------------------+
| total_people_served |
+---------------------+
|       27628140      |
+---------------------+

#### Percentage of people served

In [224]:
%%sql

SELECT
    type_of_water_source, 
    ROUND((SUM(number_of_people_served)/27628140 *100),0) AS percentage_people_served
FROM
    water_source_duplicate
GROUP BY
     type_of_water_source
ORDER BY
    percentage_people_served DESC
LIMIT 3;

Running query in 'mysql+pymysql://root:***@localhost:3306/md_water_services'

3 rows affected.

+----------------------+--------------------------+
| type_of_water_source | percentage_people_served |
+----------------------+--------------------------+
|      shared_tap      |            43            |
|         well         |            18            |
|     tap_in_home      |            17            |
+----------------------+--------------------------+

#### Setting rank for each water source type

In [225]:
%%sql

SELECT
    type_of_water_source,
    SUM(number_of_people_served) AS total_people_served,
    RANK() OVER (ORDER BY SUM(number_of_people_served) DESC) AS rank_by_population
FROM
    water_source_duplicate
WHERE
    type_of_water_source != 'tap_in_home'
GROUP BY
     type_of_water_source
ORDER BY
    total_people_served DESC
LIMIT 3;

Running query in 'mysql+pymysql://root:***@localhost:3306/md_water_services'

3 rows affected.

+----------------------+---------------------+--------------------+
| type_of_water_source | total_people_served | rank_by_population |
+----------------------+---------------------+--------------------+
|      shared_tap      |       11945272      |         1          |
|         well         |       4841724       |         2          |
|  tap_in_home_broken  |       3799720       |         3          |
+----------------------+---------------------+--------------------+

#### Queries to do the following:
1. The sources within each type should be assigned a rank.
2. Limit the results to only improvable sources.
3. Think about how to partition, filter and order the results set.
4. Order the results to see the top of the list.

In [226]:
%%sql

SELECT
    source_id,
    type_of_water_source,
    SUM(number_of_people_served) AS total_people_served,
    RANK() OVER (ORDER BY SUM(number_of_people_served) DESC) AS priority_rank
FROM
    water_source_duplicate
WHERE
    type_of_water_source != 'tap_in_home'
GROUP BY
     type_of_water_source,source_id
ORDER BY
    total_people_served DESC
LIMIT 3;

Running query in 'mysql+pymysql://root:***@localhost:3306/md_water_services'

3 rows affected.

+--------------+----------------------+---------------------+---------------+
|  source_id   | type_of_water_source | total_people_served | priority_rank |
+--------------+----------------------+---------------------+---------------+
| HaRu19509224 |      shared_tap      |         3998        |       1       |
| AkRu05603224 |      shared_tap      |         3998        |       1       |
| AkRu04862224 |      shared_tap      |         3996        |       3       |
+--------------+----------------------+---------------------+---------------+

In [115]:
%sql SELECT * FROM water_source_duplicate WHERE source_id = 'AmRu14978224';

Running query in 'mysql+pymysql://root:***@localhost:3306/md_water_services'

1 rows affected.

+--------------+----------------------+-------------------------+
|  source_id   | type_of_water_source | number_of_people_served |
+--------------+----------------------+-------------------------+
| AmRu14978224 |        river         |           400           |
+--------------+----------------------+-------------------------+

In [227]:
%%sql

SELECT
    source_id,
    type_of_water_source,
    SUM(number_of_people_served) AS total_people_served,
    RANK() OVER (ORDER BY SUM(number_of_people_served) DESC) AS priority_rank,
    ROW_NUMBER() OVER (ORDER BY SUM(number_of_people_served) DESC) AS priority_row_number
FROM
    water_source_duplicate
WHERE
    type_of_water_source != 'tap_in_home'
GROUP BY
     type_of_water_source,source_id
ORDER BY
    total_people_served DESC
LIMIT 3;

Running query in 'mysql+pymysql://root:***@localhost:3306/md_water_services'

3 rows affected.

+--------------+----------------------+---------------------+---------------+---------------------+
|  source_id   | type_of_water_source | total_people_served | priority_rank | priority_row_number |
+--------------+----------------------+---------------------+---------------+---------------------+
| HaRu19509224 |      shared_tap      |         3998        |       1       |          1          |
| AkRu05603224 |      shared_tap      |         3998        |       1       |          2          |
| AkRu04862224 |      shared_tap      |         3996        |       3       |          3          |
+--------------+----------------------+---------------------+---------------+---------------------+

#### Things worth looking at:
1. How long did the survey take?
2. What is the average total queue time for water?
3. What is the average queue time on different days?
4. How can we communicate this information efficiently?

In [228]:
%%sql

SELECT
    *
FROM
    visits_duplicate
LIMIT 3;

Running query in 'mysql+pymysql://root:***@localhost:3306/md_water_services'

3 rows affected.

+-----------+-------------+--------------+---------------------+-------------+---------------+----------------------+
| record_id | location_id |  source_id   |    time_of_record   | visit_count | time_in_queue | assigned_employee_id |
+-----------+-------------+--------------+---------------------+-------------+---------------+----------------------+
|     0     |  SoIl32582  | SoIl32582224 | 2021-01-01 09:10:00 |      1      |       15      |          12          |
|     1     |  KiRu28935  | KiRu28935224 | 2021-01-01 09:17:00 |      1      |       0       |          46          |
|     2     |  HaRu19752  | HaRu19752224 | 2021-01-01 09:36:00 |      1      |       62      |          40          |
+-----------+-------------+--------------+---------------------+-------------+---------------+----------------------+

In [229]:
%%sql

SELECT
    DATE(time_of_record)
FROM
    visits_duplicate
LIMIT 3;

Running query in 'mysql+pymysql://root:***@localhost:3306/md_water_services'

3 rows affected.

+----------------------+
| DATE(time_of_record) |
+----------------------+
|      2021-01-01      |
|      2021-01-01      |
|      2021-01-01      |
+----------------------+

In [231]:
#previewing the dates from the tune of record in tge visits table
%sql SELECT MIN(time_of_record) AS FirstDate, MAX(time_of_record) AS LastDate FROM visits_duplicate;

Running query in 'mysql+pymysql://root:***@localhost:3306/md_water_services'

1 rows affected.

+---------------------+---------------------+
|      FirstDate      |       LastDate      |
+---------------------+---------------------+
| 2021-01-01 09:10:00 | 2023-07-14 13:53:00 |
+---------------------+---------------------+

#### Calculating how long the survey took

In [140]:
%%sql 
SELECT 
    MIN(time_of_record) AS LastDate,
    MAX(time_of_record) AS LastDate,
    DATEDIFF(MAX(time_of_record),MIN(time_of_record)) AS Days,
    (DATEDIFF(MAX(time_of_record),MIN(time_of_record))/365)*12 AS Months,
    (DATEDIFF(MAX(time_of_record),MIN(time_of_record))/365) AS Years
FROM 
    visits_duplicate;

Running query in 'mysql+pymysql://root:***@localhost:3306/md_water_services'

1 rows affected.

+---------------------+---------------------+------+---------+--------+
|       LastDate      |      LastDate_1     | Days |  Months | Years  |
+---------------------+---------------------+------+---------+--------+
| 2021-01-01 09:10:00 | 2023-07-14 13:53:00 | 924  | 30.3781 | 2.5315 |
+---------------------+---------------------+------+---------+--------+

#### How long people queue on average

In [141]:
%%sql

SELECT * FROM visits_duplicate LIMIT 2;

Running query in 'mysql+pymysql://root:***@localhost:3306/md_water_services'

2 rows affected.

+-----------+-------------+--------------+---------------------+-------------+---------------+----------------------+
| record_id | location_id |  source_id   |    time_of_record   | visit_count | time_in_queue | assigned_employee_id |
+-----------+-------------+--------------+---------------------+-------------+---------------+----------------------+
|     0     |  SoIl32582  | SoIl32582224 | 2021-01-01 09:10:00 |      1      |       15      |          12          |
|     1     |  KiRu28935  | KiRu28935224 | 2021-01-01 09:17:00 |      1      |       0       |          46          |
+-----------+-------------+--------------+---------------------+-------------+---------------+----------------------+

In [144]:
%%sql

SELECT
    SUM(time_in_queue)/COUNT(time_in_queue) AS average_queue_times
FROM
    visits_duplicate
WHERE
    time_in_queue <> 0;

Running query in 'mysql+pymysql://root:***@localhost:3306/md_water_services'

1 rows affected.

+---------------------+
| average_queue_times |
+---------------------+
|       123.2574      |
+---------------------+

#### Queue times aggregated across the different days of the week.

In [232]:
%%sql

SELECT
    DATE(time_of_record) AS DATE,
    YEAR(time_of_record) AS Date_Year,
    Month(time_of_record) AS Date_Month,
    TIME(time_of_record) AS Time
FROM
    visits_duplicate
LIMIT 3;

Running query in 'mysql+pymysql://root:***@localhost:3306/md_water_services'

3 rows affected.

+------------+-----------+------------+---------+
|    DATE    | Date_Year | Date_Month |   Time  |
+------------+-----------+------------+---------+
| 2021-01-01 |    2021   |     1      | 9:10:00 |
| 2021-01-01 |    2021   |     1      | 9:17:00 |
| 2021-01-01 |    2021   |     1      | 9:36:00 |
+------------+-----------+------------+---------+

In [145]:
%%sql

SELECT
    DAYNAME(time_of_record) AS Day_of_week,
    ROUND(AVG(time_in_queue),0) AS avg_queue_times
FROM
    visits_duplicate
WHERE
    time_in_queue <> 0
GROUP BY
    DAYNAME(time_of_record);

Running query in 'mysql+pymysql://root:***@localhost:3306/md_water_services'

7 rows affected.

+-------------+-----------------+
| Day_of_week | avg_queue_times |
+-------------+-----------------+
|    Friday   |       120       |
|   Saturday  |       246       |
|    Sunday   |        82       |
|    Monday   |       137       |
|   Tuesday   |       108       |
|  Wednesday  |        97       |
|   Thursday  |       105       |
+-------------+-----------------+

#### Time of day people collect water

Integer value of the hour of the day

In [147]:
%%sql

SELECT
    HOUR(time_of_record) AS Hour_of_day,
    ROUND(AVG(time_in_queue),0) AS avg_queue_times
FROM
    visits_duplicate
WHERE
    time_in_queue <> 0
GROUP BY
    HOUR(time_of_record)
ORDER BY
    Hour_of_day;

Running query in 'mysql+pymysql://root:***@localhost:3306/md_water_services'

14 rows affected.

+-------------+-----------------+
| Hour_of_day | avg_queue_times |
+-------------+-----------------+
|      6      |       149       |
|      7      |       149       |
|      8      |       149       |
|      9      |       118       |
|      10     |       114       |
|      11     |       111       |
|      12     |       112       |
|      13     |       115       |
|      14     |       114       |
|      15     |       114       |
+-------------+-----------------+
Truncated to displaylimit of 10.

A format like 06:00 will be easier to read

In [149]:
%%sql

SELECT
    TIME_FORMAT(TIME(time_of_record), '%H:00') AS Hour_of_day,
    ROUND(AVG(time_in_queue),0) AS avg_queue_times
FROM
    visits_duplicate
WHERE
    time_in_queue <> 0
GROUP BY
    TIME_FORMAT(TIME(time_of_record), '%H:00')
ORDER BY
    Hour_of_day;

Running query in 'mysql+pymysql://root:***@localhost:3306/md_water_services'

14 rows affected.

+-------------+-----------------+
| Hour_of_day | avg_queue_times |
+-------------+-----------------+
|    06:00    |       149       |
|    07:00    |       149       |
|    08:00    |       149       |
|    09:00    |       118       |
|    10:00    |       114       |
|    11:00    |       111       |
|    12:00    |       112       |
|    13:00    |       115       |
|    14:00    |       114       |
|    15:00    |       114       |
+-------------+-----------------+
Truncated to displaylimit of 10.

In [233]:
%%sql

SELECT
    TIME_FORMAT(TIME(time_of_record), '%H:00') AS Hour_of_day,
    DAYNAME(time_of_record) AS Day_of_week,
    CASE
        WHEN DAYNAME(time_of_record) = 'Sunday' 
        THEN time_in_queue
        ELSE NULL
    END AS Sunday
FROM
    visits_duplicate
WHERE
    time_in_queue <> 0
LIMIT 3;

Running query in 'mysql+pymysql://root:***@localhost:3306/md_water_services'

3 rows affected.

+-------------+-------------+--------+
| Hour_of_day | Day_of_week | Sunday |
+-------------+-------------+--------+
|    09:00    |    Friday   |  None  |
|    09:00    |    Friday   |  None  |
|    10:00    |    Friday   |  None  |
+-------------+-------------+--------+

In [184]:
%%sql

SELECT
    TIME_FORMAT(TIME(time_of_record), '%H:00') AS Hour_of_day,    
    -- Sunday
    ROUND(AVG(
    CASE
        WHEN DAYNAME(time_of_record) = 'Sunday' 
        THEN time_in_queue
        ELSE NULL
    END
    ),0)AS Sunday,
    
    -- Monday
    ROUND(AVG(
    CASE
        WHEN DAYNAME(time_of_record) = 'Monday' 
        THEN time_in_queue
        ELSE NULL
    END
    ),0)AS Monday,

    -- Tuesday
     ROUND(AVG(
    CASE
        WHEN DAYNAME(time_of_record) = 'Tuesday' 
        THEN time_in_queue
        ELSE NULL
    END
    ),0)AS Tuesday,

    -- Wednesday
     ROUND(AVG(
    CASE
        WHEN DAYNAME(time_of_record) = 'Wednesday' 
        THEN time_in_queue
        ELSE NULL
    END
    ),0)AS Wednesday,

    -- Thursday
     ROUND(AVG(
    CASE
        WHEN DAYNAME(time_of_record) = 'Thursday' 
        THEN time_in_queue
        ELSE NULL
    END
    ),0)AS Thursday,

    -- Friday
     ROUND(AVG(
    CASE
        WHEN DAYNAME(time_of_record) = 'Friday' 
        THEN time_in_queue
        ELSE NULL
    END
    ),0)AS Friday,

    -- Saturday
    ROUND(AVG(
    CASE
        WHEN DAYNAME(time_of_record) = 'Saturday' 
        THEN time_in_queue
        ELSE NULL
    END
    ),0)AS Saturday

FROM
    visits_duplicate
WHERE
    time_in_queue != 0
GROUP BY
    TIME_FORMAT(TIME(time_of_record),'%H:00');

Running query in 'mysql+pymysql://root:***@localhost:3306/md_water_services'

14 rows affected.

+-------------+--------+--------+---------+-----------+----------+--------+----------+
| Hour_of_day | Sunday | Monday | Tuesday | Wednesday | Thursday | Friday | Saturday |
+-------------+--------+--------+---------+-----------+----------+--------+----------+
|    09:00    |   84   |  127   |   105   |     94    |    99    |  107   |   252    |
|    10:00    |   83   |  119   |    99   |     89    |    95    |  112   |   259    |
|    11:00    |   78   |  115   |   102   |     86    |    99    |  104   |   236    |
|    12:00    |   78   |  115   |    97   |     88    |    96    |  109   |   239    |
|    13:00    |   81   |  122   |    97   |     98    |   101    |  115   |   242    |
|    14:00    |   83   |  127   |   104   |     92    |    96    |  110   |   244    |
|    15:00    |   83   |  126   |   104   |     88    |    92    |  110   |   248    |
|    16:00    |   83   |  127   |    99   |     90    |    99    |  109   |   251    |
|    07:00    |   82   |  186   |   128   |    111    |   139    |  156   |   247    |
|    18:00    |   80   |  174   |   122   |    113    |   132    |  158   |   240    |
|    08:00    |   86   |  183   |   130   |    119    |   129    |  153   |   247    |
|    17:00    |   79   |  181   |   135   |    121    |   129    |  151   |   251    |
|    06:00    |   79   |  190   |   134   |    112    |   134    |  153   |   247    |
|    19:00    |  127   |  159   |   145   |    176    |   137    |  103   |   282    |
+-------------+--------+--------+---------+-----------+----------+--------+----------+

In [187]:
%%sql

SELECT
    TIME_FORMAT(TIME(time_of_record), '%H:00') AS Hour_of_day,
    DAYNAME(time_of_record) AS Day_of_week,
    ROUND(AVG(time_in_queue),0) AS avg_queue_times
FROM
    visits_duplicate
WHERE
    time_in_queue <> 0
GROUP BY
    DAYNAME(time_of_record), TIME_FORMAT(TIME(time_of_record), '%H:00');

Running query in 'mysql+pymysql://root:***@localhost:3306/md_water_services'

98 rows affected.

+-------------+-------------+-----------------+
| Hour_of_day | Day_of_week | avg_queue_times |
+-------------+-------------+-----------------+
|    09:00    |    Friday   |       107       |
|    10:00    |    Friday   |       112       |
|    11:00    |    Friday   |       104       |
|    12:00    |    Friday   |       109       |
|    13:00    |    Friday   |       115       |
|    14:00    |    Friday   |       110       |
|    15:00    |    Friday   |       110       |
|    16:00    |    Friday   |       109       |
|    07:00    |   Saturday  |       247       |
|    09:00    |   Saturday  |       252       |
|    11:00    |   Saturday  |       236       |
|    13:00    |   Saturday  |       242       |
|    09:00    |    Sunday   |        84       |
|    11:00    |    Sunday   |        78       |
|    12:00    |    Sunday   |        78       |
|    14:00    |    Sunday   |        83       |
|    07:00    |    Monday   |       186       |
|    09:00    |    Monday   |       127       |
|    11:00    |    Monday   |       115       |
|    12:00    |    Monday   |       115       |
|    14:00    |    Monday   |       127       |
|    15:00    |    Monday   |       126       |
|    16:00    |    Monday   |       127       |
|    18:00    |    Monday   |       174       |
|    07:00    |   Tuesday   |       128       |
|    08:00    |   Tuesday   |       130       |
|    09:00    |   Tuesday   |       105       |
|    10:00    |   Tuesday   |        99       |
|    11:00    |   Tuesday   |       102       |
|    12:00    |   Tuesday   |        97       |
|    13:00    |   Tuesday   |        97       |
|    14:00    |   Tuesday   |       104       |
|    15:00    |   Tuesday   |       104       |
|    16:00    |   Tuesday   |        99       |
|    17:00    |   Tuesday   |       135       |
|    06:00    |  Wednesday  |       112       |
|    07:00    |  Wednesday  |       111       |
|    09:00    |  Wednesday  |        94       |
|    10:00    |  Wednesday  |        89       |
|    11:00    |  Wednesday  |        86       |
|    12:00    |  Wednesday  |        88       |
|    13:00    |  Wednesday  |        98       |
|    14:00    |  Wednesday  |        92       |
|    15:00    |  Wednesday  |        88       |
|    16:00    |  Wednesday  |        90       |
|    18:00    |  Wednesday  |       113       |
|    06:00    |   Thursday  |       134       |
|    07:00    |   Thursday  |       139       |
|    08:00    |   Thursday  |       129       |
|    09:00    |   Thursday  |        99       |
|    10:00    |   Thursday  |        95       |
|    11:00    |   Thursday  |        99       |
|    12:00    |   Thursday  |        96       |
|    13:00    |   Thursday  |       101       |
|    14:00    |   Thursday  |        96       |
|    15:00    |   Thursday  |        92       |
|    16:00    |   Thursday  |        99       |
|    17:00    |   Thursday  |       129       |
|    06:00    |    Friday   |       153       |
|    07:00    |    Friday   |       156       |
|    08:00    |    Friday   |       153       |
|    17:00    |    Friday   |       151       |
|    06:00    |   Saturday  |       247       |
|    08:00    |   Saturday  |       247       |
|    10:00    |   Saturday  |       259       |
|    12:00    |   Saturday  |       239       |
|    15:00    |   Saturday  |       248       |
|    17:00    |   Saturday  |       251       |
|    18:00    |   Saturday  |       240       |
|    06:00    |    Sunday   |        79       |
|    07:00    |    Sunday   |        82       |
|    08:00    |    Sunday   |        86       |
|    13:00    |    Sunday   |        81       |
|    16:00    |    Sunday   |        83       |
|    18:00    |    Sunday   |        80       |
|    06:00    |    Monday   |       190       |
|    08:00    |    Monday   |       183       |
|    10:00    |    Monday   |       119       |
|    13:00    |    Monday   |       122       |
|    17:00    |    Monday   |       181       |
|    06:00    |   Tuesday   |       134       |
|    18:00    |   Tuesday   |       122       |
|    08:00    |  Wednesday  |       119       |
|    17:00    |  Wednesday  |       121       |
|    18:00    |    Friday   |       158       |
|    14:00    |   Saturday  |       244       |
|    16:00    |   Saturday  |       251       |
|    10:00    |    Sunday   |        83       |
|    17:00    |    Sunday   |        79       |
|    19:00    |  Wednesday  |       176       |
|    15:00    |    Sunday   |        83       |
|    19:00    |   Tuesday   |       145       |
|    18:00    |   Thursday  |       132       |
|    19:00    |   Thursday  |       137       |
|    19:00    |    Sunday   |       127       |
|    19:00    |   Saturday  |       282       |
|    19:00    |    Friday   |       103       |
|    19:00    |    Monday   |       159       |
+-------------+-------------+-----------------+

In [189]:
%sql SELECT day(time_of_record), monthname(time_of_record), year(time_of_record) FROM visits LIMIT 3;

Running query in 'mysql+pymysql://root:***@localhost:3306/md_water_services'

3 rows affected.

+---------------------+---------------------------+----------------------+
| day(time_of_record) | monthname(time_of_record) | year(time_of_record) |
+---------------------+---------------------------+----------------------+
|          1          |          January          |         2021         |
|          1          |          January          |         2021         |
|          1          |          January          |         2021         |
+---------------------+---------------------------+----------------------+